models/autoports/google_gemma_4_26b_a4b_it/readiness_vllm/P150x2/optimized_vllm/after_warmed/vllm_ci_serving_benchmark.log
INFO 09-08 20:58:18 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 09-08 20:58:18 [__init__.py:46] - tt -> vllm_tt_plugin.entrypoints:platform_plugin
INFO 09-08 20:58:18 [__init__.py:49] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
2026-09-08 20:58:19.317 | DEBUG    | ttnn:<module>:45 - Initial ttnn.CONFIG:
Config{cache_path=/home/hous/.cache/ttnn,model_cache_path=/home/hous/.cache/ttnn/models,tmp_dir=/tmp/ttnn,enable_model_cache=false,enable_fast_runtime_mode=true,validate_program_args=false,throw_exception_on_fallback=true,enable_logging=false,enable_graph_report=false,enable_graph_python_stack_traces=false,enable_detailed_buffer_report=false,enable_detailed_tensor_report=false,enable_comparison_mode=false,comparison_mode_should_raise_exception=false,comparison_mode_pcc=0.9999,root_report_path=generated/ttnn/reports,report_name=std::nullopt,std::nullopt}
INFO 09-08 20:58:19 [__init__.py:253] Platform plugin tt is activated

################################################################################
#                                                                              #
#        **************************************************************        #
#                                                                              #
#                             D E P R E C A T E D                              #
#                                                                              #
#        **************************************************************        #
#                                                                              #
#          This vLLM fork (tenstorrent/vllm) is no longer maintained.          #
#         Tenstorrent support now ships as a plugin for UPSTREAM vLLM:         #
#                                                                              #
#          >>>   https://github.com/tenstorrent/vllm-tt-plugin   <<<           #
#                                                                              #
#      No further fixes, model enablement, or upstream merges land here,       #
#     and this repository will be archived. Migrate now: install upstream      #
#        vLLM plus vllm-tt-plugin, following that repository's README.         #
#                File issues and pull requests there, not here.                #
#                                                                              #
################################################################################

INFO 09-08 20:58:21 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 09-08 20:58:21 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7308867d0220>, trust_remote_code=False, seed=0, num_prompts=32, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=100, random_output_len=100, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='google/gemma-4-26B-A4B-it', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=1, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename='/home/hous/dev/tt-metal/models/autoports/google_gemma_4_26b_a4b_it/readiness_vllm/P150x2/optimized_vllm/after_warmed/vllm_ci_serving_result.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-3ccaa2b5-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False)
INFO 09-08 20:58:24 [datasets.py:607] Sampling input_len from [100, 100] and output_len from [100, 100]
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 1 requests...
100%|██████████| 1/1 [00:02<00:00,  2.45s/it]
Successful warmup requests: 1/1
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 32/32 [00:26<00:00,  1.22it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     32        
Failed requests:                         0         
Benchmark duration (s):                  26.27     
Total input tokens:                      3200      
Total generated tokens:                  3200      
Request throughput (req/s):              1.22      
Output token throughput (tok/s):         121.80    
Peak output token throughput (tok/s):    160.00    
Peak concurrent requests:                32.00     
Total token throughput (tok/s):          243.60    
---------------Time to First Token----------------
Mean TTFT (ms):                          3951.98   
Median TTFT (ms):                        3472.65   
P99 TTFT (ms):                           5167.00   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          225.44    
Median TPOT (ms):                        230.29    
P99 TPOT (ms):                           253.22    
---------------Inter-token Latency----------------
Mean ITL (ms):                           225.44    
Median ITL (ms):                         199.55    
P99 ITL (ms):                            648.66    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          26270.74  
Median E2EL (ms):                        26270.61  
P99 E2EL (ms):                           26271.86  
==================================================
nanobind: leaked 102 instances!
 - leaked instance 0x730897cfc6d8 of type "ttnn._ttnn.tensor.CoreRangeSet"
 - leaked instance 0x19635040 of type "ttnn._ttnn.operations.unary.neg_t"
 - leaked instance 0x196297e0 of type "ttnn._ttnn.operations.unary.sigmoid_t"
 - leaked instance 0x19229030 of type "ttnn._ttnn.operations.unary.hardswish_t"
 - leaked instance 0x188aba60 of type "ttnn._ttnn.operations.unary.isneginf_t"
 - leaked instance 0x730897dd41e8 of type "ttnn._ttnn.tensor.MemoryConfig"
 - leaked instance 0x194332e0 of type "ttnn._ttnn.operations.unary.rsqrt_t"
 - leaked instance 0x18b602f0 of type "ttnn._ttnn.operations.unary.identity_t"
 - leaked instance 0x730897b3c808 of type "ttnn._ttnn.tensor.MemoryConfig"
 - leaked instance 0x194f4a40 of type "ttnn._ttnn.operations.unary.abs_t"
 - leaked instance 0x730897ee0b88 of type "ttnn._ttnn.multi_device.MeshCoordinate"
 - leaked instance 0x18d103f0 of type "ttnn._ttnn.operations.unary.relu_t"
 - leaked instance 0x16eaa730 of type "ttnn._ttnn.operations.unary.erfinv_t"
 - leaked instance 0x7308eb5852d8 of type "ttnn._ttnn.program_descriptor.VectorUInt32"
 - leaked instance 0x192a2ed0 of type "ttnn._ttnn.operations.unary.lez_t"
 - leaked instance 0x19410fc0 of type "ttnn._ttnn.operations.unary.logical_not_t"
 - leaked instance 0x1980e7e0 of type "ttnn._ttnn.operations.unary.square_t"
 - leaked instance 0x730897b3dac8 of type "ttnn._ttnn.operations.sliding_window.Op2DSliceConfig"
 - leaked instance 0x730897dd59a8 of type "ttnn._ttnn.operations.normalization.SoftmaxDefaultProgramConfig"
 - leaked instance 0x19407080 of type "ttnn._ttnn.operations.unary.log1p_t"
 - ... skipped remainder
nanobind: leaked 984 types!
 - leaked type "SocketEndpoint"
 - leaked type "ttnn._ttnn.operations.experimental.quasar.gt__t"
 - leaked type "ttnn._ttnn.operations.experimental.attn_res_gather_softmax_t"
 - leaked type "ttnn._ttnn.d2d_stream_service.D2DStreamServiceSender"
 - leaked type "ttnn._ttnn.operations.experimental.quasar.SliceDeviceOperation"
 - leaked type "ttnn._ttnn.operations.experimental.quasar.MatmulMultiCoreReuseMultiCastBatchedDRAMShardedProgramConfig"
 - leaked type "ttnn._ttnn.operations.binary.lt__t"
 - leaked type "ttnn._ttnn.operations.binary_backward.xlogy_bw_t"
 - leaked type "ttnn._ttnn.operations.experimental.insert_t"
 - leaked type "ttnn._ttnn.operations.experimental.quasar.isclose_t"
 - ... skipped remainder
nanobind: leaked 4503 functions!
 - leaked function "__init__"
 - leaked function ""
 - leaked function "__call__"
 - leaked function "CloseDevices"
 - leaked function "__call__"
 - leaked function ""
 - leaked function "__call__"
 - leaked function "get_active_cores"
 - leaked function ""
 - leaked function ""
 - ... skipped remainder
nanobind: this is likely caused by a reference counting issue in the binding code.
See https://nanobind.readthedocs.io/en/latest/refleaks.html